<?php
/**
 * 消息与提示类相关配置
 */
return array(
    'SMS_MESSAGES' => array(
        'register' => "您在鸟听的验证码为：%s, 请勿转发，谢谢！",
        'resetpwd' => "您在鸟听重置密码的验证码为：%s, 请勿转发，谢谢！",
    ),
    'RETURN_CODES' => array(
        //通用
        200 => '操作成功',
        201 => '操作完成',
        301 => '无效的操作方法！',
        302 => '无效参数！',
        303 => '数据保存失败！',
        304 => '没有权限',
        305 => '验证失败，请稍后重试',
        306 => '客户端时间设置不正确',
        307 => 'SIGN签名验证失败',
        308 => '签名己过期',
        399 => '未知错误',
        //用户相关
        401 => '该手机号码未注册！',
        402 => '该手机号码已存在！',
        403 => '请指定有效的验证类型！',
        404 => '请输入有效的手机号码！',
        411 => '短信操作失败！', //调用短信发送类失败
        412 => '短信接口失败！', //调用短信发送接口失败
        413 => '短信验证码写入失败！',
        421 => '手机号不能为空',
        422 => '验证码不能为空',
        423 => '无效的验证码',
        424 => '验证码已过期',
        431 => '密码不能为空',
        432 => '帐号被锁定',
        433 => '密码错误',
        434 => '未找到用户信息',
        435 => '密码重置失败',
        436 => '密码不能为空',
        437 => '用户信息验证失败',
        438 => '原密码输入错误',
        439 => '用户资料更新失败',
        440 => '图片上传失败',
        441 => '用户绑定失败',
        //关注相关
        500 => '用户己经是关注状态，不能重复关注',
        501 => '自己不能与自己的帐号不能进行关注相关操作',
        502 => '帐号之前没有关注，无法取消',
        503 => '未找到被关注者的信息',
    ),
);
